docker/dockerfiles/rails_sample-app/project/app/helpers/sessions_helper.rb

  def signin(user)
    remember_token = User.new_remember_token
    cookies.permanent[:remember_token] = remember_token
    user.update_attribute(:remember_token, User.encrypt(remember_token))
---
UPDATE "users" SET "remember_token" = $1, "updated_at" = $2 WHERE "users"."id" = 1

  def current_user
    unless @current_user
      remember_token = User.encrypt(cookies[:remember_token])
      @current_user  = User.find_by(remember_token: remember_token)
---
SELECT  "users".* FROM "users"  WHERE "users"."remember_token" = 'f3638193c1398531121dbc9ad30fa239cabc0b41' LIMIT 1